app/Controllers/Home.php

SELECT `peminjaman`.*, `sarana`.`nama_sarana`
FROM `peminjaman`
LEFT JOIN `sarana` ON `sarana`.`id_sarana` = `peminjaman`.`id_sarana`
WHERE `peminjaman`.`id_user` = '3'
AND `status` IN ('disetujui','dipinjam')
---
    public function index()
    {
        $role   = session()->get('role');
        $idUser = session()->get('id_user'); // pastikan sudah diset di login

        if ($role === 'admin' || $role === 'kepsek') {
            // Statistik untuk admin & kepsek
            $data = [
                'title'         => 'Dashboard',
                'totalSarana'   => $this->SaranaModel->countAll(),
                'totalAll'      => $this->peminjamanModel->countAll(),
                'totalPending'  => $this->peminjamanModel->where('status', 'pending')->countAllResults(),
                'totalSetujui'  => $this->peminjamanModel->where('status', 'disetujui')->countAllResults(),
                'totalDipinjam' => $this->peminjamanModel->where('status', 'dipinjam')->countAllResults(),
                'totalTolak'    => $this->peminjamanModel->where('status', 'ditolak')->countAllResults(),
                'totalKembali'  => $this->peminjamanModel->where('status', 'dikembalikan')->countAllResults(),
            ];
        } else {
            // Notifikasi untuk siswa/guru
            $peminjaman = $this->peminjamanModel
                ->select('peminjaman.*, sarana.nama_sarana')
                ->join('sarana', 'sarana.id_sarana = peminjaman.id_sarana', 'left')
                ->where('peminjaman.id_user', $idUser)
                ->whereIn('status', ['disetujui', 'dipinjam'])
                ->findAll();