app/Controllers/Jenis.php

SELECT *
FROM `jenis`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `jenis`
---
    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $perPage = 10; // Jumlah data per halaman

        if ($keyword) {
            $jenis = $this->jenisModel->search($keyword, $perPage);
        } else {
            $jenis = $this->jenisModel->paginate($perPage);