app/Controllers/Peminjaman.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $perPage = 10;
        $role    = session()->get('role');
        $idUser  = session()->get('id_user');

        $builder = $this->peminjamanModel
            ->select('peminjaman.*, users.nama as nama_user, sarana.*')
            ->join('users', 'users.id_user = peminjaman.id_user', 'left')
            ->join('sarana', 'sarana.id_sarana = peminjaman.id_sarana', 'left');

        // Kalau bukan admin/kepala sekolah → hanya bisa lihat pinjaman miliknya
        if (!in_array($role, ['admin', 'kepsek'])) {
            $builder->where('peminjaman.id_user', $idUser);
        }

        // Tambahkan pencarian
        if ($keyword) {
            $builder->groupStart()
                ->like('users.nama', $keyword)
                ->orLike('sarana.nama_sarana', $keyword)
                ->orLike('peminjaman.status', $keyword)
                ->groupEnd();
        }

        $peminjaman = $builder->paginate($perPage);
---
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
LEFT JOIN `users` ON `users`.`id_user` = `peminjaman`.`id_user`
LEFT JOIN `sarana` ON `sarana`.`id_sarana` = `peminjaman`.`id_sarana`
WHERE `peminjaman`.`id_user` = '3'
SELECT `peminjaman`.*, `users`.`nama` as `nama_user`, `sarana`.*
FROM `peminjaman`
LEFT JOIN `users` ON `users`.`id_user` = `peminjaman`.`id_user`
LEFT JOIN `sarana` ON `sarana`.`id_sarana` = `peminjaman`.`id_sarana`
WHERE `peminjaman`.`id_user` = '3'
 LIMIT 10

    public function update($id)
    {
        $this->peminjamanModel->update($id, [
            'status' => $this->request->getPost('status')
        ]);
---
UPDATE `peminjaman` SET `status` = 'disetujui'
WHERE `peminjaman`.`id_peminjaman` IN ('2')

    public function cetak($id)
    {
        $peminjaman = $this->peminjamanModel
            ->select('peminjaman.*, users.nama as nama_user, sarana.*')
            ->join('users', 'users.id_user = peminjaman.id_user')
            ->join('sarana', 'sarana.id_sarana = peminjaman.id_sarana')
            ->where('id_peminjaman', $id)
            ->first();
---
SELECT `peminjaman`.*, `users`.`nama` as `nama_user`, `sarana`.*
FROM `peminjaman`
JOIN `users` ON `users`.`id_user` = `peminjaman`.`id_user`
JOIN `sarana` ON `sarana`.`id_sarana` = `peminjaman`.`id_sarana`
WHERE `id_peminjaman` = '2'
 LIMIT 1