app/Controllers/Profil.php

UPDATE `profil` SET `nama_profil` = 'Ahmad Mauludin', `alamat` = 'Cisarua', `no_telp` = '9879438787', `email` = 'ahmad.mauludin247@guru.smk.belajar.id', `kelas` = '12', `keterangan` = 'aktiv'
WHERE `id_user` = '1'
---
    public function update($id_user)
    {
        $data = [
            'nama_profil' => $this->request->getPost('nama_profil'),
            'alamat'      => $this->request->getPost('alamat'),
            'no_telp'     => $this->request->getPost('no_telp'),
            'email'       => $this->request->getPost('email'),
            'kelas'       => $this->request->getPost('kelas'),
            'keterangan'  => $this->request->getPost('keterangan'),
        ];

        $this->profilModel->where('id_user', $id_user)->set($data)->update();