app/Controllers/Sarana.php

SELECT COUNT(*) AS `numrows`
FROM `sarana`
LEFT JOIN `jenis` ON `jenis`.`id_jenis` = `sarana`.`id_jenis`
SELECT `sarana`.*, `jenis`.`nama_jenis`
FROM `sarana`
LEFT JOIN `jenis` ON `jenis`.`id_jenis` = `sarana`.`id_jenis`
 LIMIT 10
---
    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $perPage = 10; // jumlah data per halaman

        if ($keyword) {
            $sarana = $this->saranaModel
                ->select('sarana.*, jenis.nama_jenis')
                ->join('jenis', 'jenis.id_jenis = sarana.id_jenis', 'left')
                ->like('sarana.nama_sarana', $keyword)
                ->orLike('sarana.kode_sarana', $keyword)
                ->orLike('jenis.nama_jenis', $keyword)
                ->paginate($perPage);
        } else {
            $sarana = $this->saranaModel
                ->select('sarana.*, jenis.nama_jenis')
                ->join('jenis', 'jenis.id_jenis = sarana.id_jenis', 'left')
                ->paginate($perPage);

SELECT *
FROM `jenis`
---
    public function create()
    {
        $data = [
            'title' => 'Tambah Sarana',
            'jenis' => $this->jenisModel->findAll() // ambil semua jenis untuk dropdown