app/Controllers/Users.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $perPage = 10; // Jumlah data per halaman

        if ($keyword) {
            $users = $this->usersModel->search($keyword, $perPage);
        } else {
            $users = $this->usersModel->paginate($perPage);
---
SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`

    public function update($id)
    {
        $model = new UsersModel();
        $users = $model->find($id);
        $password = $this->request->getPost('password') ? password_hash($this->request->getPost('password'), PASSWORD_DEFAULT) : $users['password'];

        $data = [
            'nama' => $this->request->getPost('nama'),
            'username' => $this->request->getPost('username'),
            'role' => $this->request->getPost('role'),
            'password' => $password
        ];

        if ($foto = $this->uploadFoto()) {
            $data['foto'] = $foto;
        }

        $model->update($id, $data);
---
UPDATE `users` SET `nama` = 'admina', `username` = 'admina', `role` = 'admin', `password` = '$2y$10$DubJBEiwnYq0JuXJi715Ke7bpNBHgPxP2vO5.gORbHmCQVhEVOH/u'
WHERE `users`.`id_user` IN ('1')